board=[[3,4,2],[6,1,5],[8,7,0]]

for z,x,v in board:
    print(z,x,v)

r=2
c=2

while True:
    k = input('w,a,s,d 중 하나를 입력하세요.')
    if k =='w' and r!=0:
        board[r][c], board[r-1][c] = board[r-1][c], board[r][c]
        r=r-1
        c=c
    if k=='w' and r==0:
        print('움직일 수 없습니다.')

#-------------------------------------------------------------------------------------------------

    if k=='a' and c!=0:
        board[r][c], board[r][c-1] = board[r][c-1], board[r][c]
        r=r
        c=c-1
    if k=='a' and c==0:
        print('움직일 수 없습니다.')

#-------------------------------------------------------------------------------------------------

    if k=='s' and r!=2:
        board[r][c], board[r+1][c] = board[r+1][c], board[r][c]
        r=r+1
        c=c
    if k=='s' and r==2:
        print('움직일 수 없습니다.')

#--------------------------------------------------------------------------------------------------

    if k=='d' and c!=2:
        board[r][c], board[r][c+1] = board[r][c+1], board[r][c]
        r=r
        c=c+1
    if k=='d' and c==2:
        print('움직일 수 없습니다.')

#------------------------------------------------------------------------------------------------

    else:
        print('다른 값을 입력하세요.')
        
    if board==[[1,2,3],[4,5,6],[7,8,0]]:
        print('성공')
        break;

    for z,x,v in board:
        print(z,x,v)

    
